var levelArray = new Array();
levelArray[0] = "的一是在不了有和人這中大為上個國我以要地他時來用們生到作出就分於對成會可主發年動同工也能下過子說產種行而方面後多定學法所民得經十三之進等部度家電力如水化高都自二理起小長物現實加量兩體機還當使點從業本重去把性好應開它合因制由其些然前外天政四日那社義事平形相全裏間樣表與關各新線內數正心反你明看原又麼利比或但質氣第向道命此沒變條只結解問意建月公無軍很情者最立代想已通提直題黨程展五果料象員革位入常文總次品式活設及管特件求老頭基資邊流路級少圖山統接知較將組見計別她手角期根論運農指幾九區強放決西被做必戰先則任取據回給調處隊南色光門即保治北造百規熱領七海口東導器壓世金增爭濟階油思術極交受幹聯認六共權收證改清志己美再轉更單風切打白教速花帶安場身車例真務具萬每目至達走積示議聲報鬥完類八離華名確科傳張才信馬節話米採整空元況今集溫土許步群石廣且記需段研界拉林律叫究觀越織裝影算低持音眾系書容兒際商非驗連斷率深難近須礦千省委素技備半辦青列習便響約支般史感勞團往酸稱市克何除消構府甚太精歷值係周什號族維劃選標寫存候親毛快查效斯院江型眼王按格養易置派層片始卻專狀育廠京識適參屬圓包火住滿縣局照準紅輕引細聽該鐵價嚴底首液";
levelArray[1] = "官德隨病失爾死講呢蘇配女黃推顯談罪神藝席含企望密批營項防舉球英氧勢告李落布木幫輪破亞朝師圍遠字材注排供河態封另復施減樹溶怎止案台言士均武固葉魚波視僅差費降緊愛左章早害續服食試充兵源判似司護足某練略田黑犯負擊繼興堅輸曲修故城覺夫夠送笑船右財吃富春職漢畫功巴裡跟雖雜板飛佔曾樂致檢吸里助陽互初創抗考投壞策古徑換未跑留鋼端責站簡升述錢副盡帝射草範承獨令限阿宣環雙請超微讓控州良軸找否紀益依優頂礎載倒房突坐粉敵客袁冷勝絕析塊劑測絲協訴陳仍羅餘鹽友洋錯苦夜刑移模頻念逐靠混母短皮終聚汽村哪既衛距校停烈央察燒迅境若印洲刻括激孔搞室待核散侵吧甲久菜味舊湖貨彈損預阻毫乙普穩媽植息擴銀語揮酒雲守拿序紙醫熟缺雨嗎針劉啊急唱訓誤願審血附茶鮮糧斤孩脫硫善肥演龍父漸歡掌械歌沙獲著剛製攻謂盾討晚佈粒亂燃矛乎殺複藥寧魯貴煤伯讀班句香迫介豐培握蘭弦擔蛋沉假執穿答誰順煙縮臉喜腳異免困背星福買染井概慢怕游磁倍祖皇薄促靜補評鐘翻肉踐尼衣寬揚棉希傷操藏垂宜秋氫露套督筆振亮憲末架慶綠編牛映觸銷雷座詩居抓裂胞呼娘景盟威晶厚衡孫延雞危膠屋鄉沖臨陸顧掉呀奇燈歲措束耐劇玉趙跳哥季課凱額齊款紹偉蒸永殖宗苗川爐弱楊零奏沿岩探滑鎮飯濃航懷趕庫奪伊";
levelArray[2] = "稅靈途滅賽召歸鼓播盤裁險康唯錄菌純蓋橫繫私符努堂域糖槍潤幅哈竟澤腦壤碳歐側遍寨干敢徹惡慮斜庭納于塞折飼伸濕麥荷暗瓦床卡築戶塔訪透刀旋借氯遇份毒泥退洗蟲擺灰彩賣圈耗夏擇忙獻銅硬予削卷繁雪亦函抽篇陣陰丁尺追堆盛雄迎泛樓爸避謀噸野豬旗偏典館索秦脂潮爺忽塑遺松累愈朱替纖豆傾粗尚痛楚驚壁衝謝奮購磨君池旁碎骨徵監捕弟胡暴割殊貫釋托詞頓寶午塵聞揭炮殘橋婦綜警招吳付浮遭徐冬您搖谷箱隔訂男吹園柱唐紛敗嘴宋玻巨耕坦榮灣閉鍵剝凡並駐救鍋恩凝堿齒截跡麻禁紡廢版緩淨睛昌婚涉筒插岸朗莊街姑貿奴煉腐啦慣乘恢勻梁紗辯耳彪抵臣億脈璃秀薩俄網舞店噴縱寸童汗洪賀閃掛柬爆烯勒津軋稻軟勇像杆厘滾蒙芳肯坡腿儀旅尾伙蕩冰貢登黎鑽秘逃障氨湯郭亡峰幣港伏夢畝軌畢擦莫刺浪援株健售股采島泡甘睡鑄休閥牧繞哲炸磷朋績淡啟尖陷柴呈徒顏淚稍忘扎泵藍拖洞弄授鏡埔壯辛鋒虛貧佛彎摩泰匯幼尊廷窗綱氏隸疑宮姐震瑞怪尤夾循琴描膜違珠緣腰枝森窮竹溝催憶繩邦剩欄漿擁牙貯禮濾鈉紋咱拍罷幸喊袖埃勤焦罰伍潛墨縫姓刊畜飽獎鋁余鬼麗挖跨默鏈仿掃喝袋殼炭幕諸弧污勵梅奶潔災舟鑒苯訟抱毀懂寒智寄屆躍挑渡丹艱貝拔爹戴碼芽碰赤漁哭鉛敬顆奔欲仲柯稀虎妹乏珍桌申遵允螺隆倉魏曉銳征兼氮隱";
levelArray[3] = "牆礙赫忠撥准肅缸搶牽博巧兄杜訊誠碧祥頁巡矩尋悲灌齡倫票桂聖恰恐鄭趣抬荒貼騰柔滴呵猛輛闊勁妻填撤儲舍淺鬧擾紫讚砂戲遞吊陶伐療瓶婆臂撫摸忍蝦胸鄰偶擠棄鞏鋪乳槽鬆仁吉鄧熔爛磚租簽烏艦伴瓜丙暫燥譜橡暖柳牌秧縴迷膽詳簧踏呆瓷賓洛糊憤競隙怒粘乃緒肩籍輝敏熙皆桿偵懸掘享糾醒狂鎖恨牲霸誌爬賞玩逆陵祝浙秒貌役彼悉冒鴨蠟趨塗鳳晨輩秩卵署梯炎灘篩驅峽啥壽譯浸泉帽硅遲疆棋貸漏冠嫩稿脅芯牢叛蝕奧鳴嶺羊憑串塘繪融酵盆錫廟凍攝籌輔襲拒筋僚旱鉀漆鳥眉添疏棒穗埋硝韓僑扭逼挺涼栽碗炒杯勸患贊餾豪遼勃鴻吏旦拜狗輥掩飲搬罵勾辭扣丈估絨蔣霧麵姆擬朵宇輯陝番雕償蓄剪崇倡咬廳薯駛刷斥賦奉扇曼沈漫澆鈣桃仔扶俗返虧腔鞋叔悄撞框覆週騙勘旺沸孤黏吐孟屈渠仰妙惜疾辟狠脹諧拋喂霉桑哩衰嘛崗棱滲盜髒賴甜曹閱厲肌烴巷毅緯昨偽煮症搭釘莖籠嘆綸酷鬍偷弓錐恒遊坑鼻敘獄翼絡逮湧罐抑棚膨寺砌蔬驟穆冶枯凸紳坯焰犧冊轟緻晉瘦喪壟錠錦旬鍛邀欣亭酯舒邁憂脆閒撲漲羽酚頑卸拌仗陪姚懲杭捉肚飄漂搜吾昆欺郎汁烷蕭郵雅飾屍燕遷姻撒赴宴債帳煩斑旨鈴醇董姿雛餅傅妥腹拆捅揉澱賢歪葡丟徽浩胺墊昂擋覽貪慰抹繳馮樑汪慌諾姜誼闆劣耀誣攪昏盈躺喬溪騎叢盧譽咨悶屏駕倆悟纜摘擲餌堡頗幻惠柄佳慘";
levelArray[4] = "仇御窩臘宿劍滌瞧潑罩蔥撈泊霍胎蒼湘濱砍霞邵酬萄淮熊瘋遂烘糞戈檔嫂裕駁徙嚇捐箭撐腸攤殿蓮辨醬疫哀堵蔡沫皺暢疊萊閣敲轄痕鉤壩溜丘玄禍餓曰彭邏卿吞妨艇韋怨柏歇矮捻祿郊漠冤宏粹顛仙肪刮押挨娃醛拾勿侯吪夕戀鋅篡兆淋蓬豈釉妄拘捲魂摧氟頌渾誘蹟鈾犁譴嘉墻戚扯滋猶舶萌頒焊舌匹嘗媳肺掠烹疲釀窄馳鴉狹辱契敦遣菲韌拳辣稈臥醉墓矣竭茅艷輿締賬尿葬履渣禽襯賠躲奸溉稼賊妃抖醋廉掀晴褲后茫亥悠攔慧闡佐孝豎佩繡遙麟挽捨逝愁昭肖窯臭芬逢捷堤宙盲閘披輻鑿凶幽拓杠狼崩慎綢蜂惟誓錶餐叉址幟彌芝僕唉濤慨翠饑劫卜盒倘寂椒炳畏閤頸凌喉墾巾拚獸乾爽蔽蘆掙竊譚謬褐傘儒翅顫剖晃胚湊濁眠杰霜礁蔑喀抄奈闖碑耶蓉刨喚壺柵猜蹲掏梳樸澳玲紐綿郡鋸膀錘鼠椅殷穴遮吵萍厭俱呂囊捧澄哎瞬閩雌饒哨滸俺茂蘗勳肝盯籽恥濫菊帥戒鞭詢鎂宅淀烤賈跌笛蠻鄂棍睜鷊云岌曆鼎侍嚷藩匪穎糟纏卑堪壇氛悅碘縛屠攀溢甫凹拱攜晰朽吟迪菱謙俊嬸盼艘芒唇挫浴羞趁岳愚疼腫萎樞絞餵嫁慕茲艙蘋豫諭蠶潘翁迭頃匠榜欠沾疇胃茬蹤哼弊桐歧沃潰鵬悼惑蔗晒潭孢診庸渦迴嫌聰哦廚梭祁肆贈鉗龐崖醜籃并甸胖藻誇搗撕詔貞慈炕賜卓汛瓊鏟撓棵灶饋嬰祭膚蒂衫侖傑勉瀝滬逸嗓暈浦蜜膏艾贏兔孕憐扮蒲鵝嚦挪淑謠廊懼緬俘咽驕宰陡僱";
levelArray[5] = "峻惱腺誕夷愉獵魔喲扛葛蔭銨脊倚扁杏橢溴滯苛鈔錳鑲捏斬氓傲僵匆屑燙衍郁鹵攏裸邪坊渴舅泄翔廈櫃欽窖貓媒脾噪晝蛇耙耿曇秤粱糕衷販辰哇囑宦扔杉詐吁岡廓悔皂氰肴剎勺寓瑪矢垮淘瓣筍罕鍾喇帕恭摔桉秉銘鬚齋儉叭帆瘤砸祼篷肢藤拐脖暑瞪殲竿笙蘊酮嘩瞎刃嵌楔紮藉喘廂撾枚粵咸拴爪甩膝懇腕娓屢熄錨噹忌愧丸圃榨荊騷屯毯蒜蠋俯弗梢衙鹿扒灑轎啞壘諒賤踢棕泳泌渥滔銜餉吻擱梨櫻熬奠姨乒惕聘鄆冀綁咖尉裹酥寡彥啡稠拼擅汝汰蚌鈍銹捆敞遜雀棟謹鯉咳搏葫賄鱗占塌忉謊咋怖戊桔膩龜嘻墳禾坎拇摻煽獅寇梗鷹哄胳莽雯傻喻坪淵糠涅跪釗侮奕枕膛蕊譬兌寥扼辮腥郝戍曬耦蹄鈞匈屁戥樁瞿誦倦嶼抒涵袍釣嗣忿敷湜聊虹蹈鹹嗯姬淒燦狡糙蹬僧嗨栖笨辜枉翰茨諷呱岐嶄棗咕攬洶澇焚猴耍趟傍劈爵璋虜鍍昔瞅踩迄鑰汞祺詭魄嘲惶贓咐歉癌廬扳聶芡軀鄙擰煌襄貶隋佑寵懶栓滇炊謇憾裙贛駱兜孵曝泣猖痼盥絮韻噢曠洴盞眷茄暮榴淆濺煎琪鰲乞吼唧噠巢槐沛蜇蜀賺陛冪咒堯捍昇鉸叮煥煞耽褂募揀搓淹釜鉻雹灼瑰鄒鰱嬌彰焉荐躬匙咯庶惹淪琳畔蛤鶴斃漬皖禹邢卒庵淫竄繃翹簞陌兇巫柜玫膊韃拂瀾綏蕉贖雇囪寅稚縷賭躁鋤頰庚氦珊苟薦蛭蛻酌魁撇朕燾蔓豌逗閨佃侄桅熒緝襟鎳乍噯娶洒聳飪唸囂瀑痴筐裳靖靶韶崔繭蓿鎔剿喃娥岔搪撮氘";
levelArray[6] = "雍霖撰粥虫吱慷檐琦莉襪豹赦邑闢駿凳喧媚挾晤睹籲舵隘雁鰓俞嚼愣揪樺澧蠢唆噶弛懈澗絹薪寞憎戎氈沼眨磺鈕鑼傭奢矯腎薛丞巍橙澀疙碌脯蠅髓鮑厄嘎宛淤畸砝磅簇羥荔蕾虐逾姊斧烙狄蚜喳垠帘斌棺瑣瞞筏騾鴕囚惰昧殳爍祇窒僻啼坤婷怯晌楣鎊黔丫崧怔晾棘泮溯瀉睦窺蜡陋吶噓墩悢蕕釁麓唔嗜墜孰屜慾旭梆瑟眯臧菇饁剔寢峨炔熾琤瑾簾肋肘臺蛹鞍鹼嗅婿孜楞涯癢禎禪羨虱醞伎宵峭朴楓熹蚊蝶驢丑噬夥庇杖牡稽蔚逞鞠餃馴吭栩犬皿硼竺羧訝詠訶鞘垢妖攫歹碉磕豁鏵阮飀傀凰咧啤廙楷渤熏聾閔彝斂朔淌瞻禦綴緞軒併儡墮憓抨摯汀瀆稟筷蒴蟹詫赳陀峒紉蕪謁券哉嗚扞漓碾禿茸蔔跋迂銼駝俠嘿崎恫摹檬檸誅躅醚餡魅魑伺唾幢戔槳瑯穫箋苓茯謎鈦鋰柿楠毓涕渭炯茵襖逛霄劾娛洽湝眶箍胥鈷鉑嚙妝慚拈棠氬硒蓀蘸袱鋇乖嘯奎娟巰帖彤戳滍禺籮紊羿芋裘諱謗尹渺澈箏篤簿鯽鯨吆哺啃埠栗汾猾碩託鮒岑峙庤廖徘榆氡湍潺琢砧莎踱錮閻阜隧魷嘶妮捂毆汆筘苔刪喓圭捄殆熨眺睪侈侶垛恍湛甄稜羲翊芹鉬匿恃戩殃毋灤狐竣舜荀訣諄餞鬱剁叩婉憩朦樟氚淬窟詹亨咚嗽圜壑崽滄澡痢癱碟葵覓逶靴頹飴駭嘰嚨廿朧沁焯翩腮膿薇蝸褘觜誹邱馱驛埂奄彙怡椰浚焙猩痒礬絢耑膳褥褶諫鍔鏽颱匝呃嵐廁彬恣戮撼椿樊沂淳狽竅綽褙蹦髯卉幀瑛綺菩萱闓呻堰妓";
levelArray[7] = "娣嬉徭掂揩擒攘檻莢蚓蚯趾酐銻頲飢龔兢嘔夭摟斟曙札枷殯祀穜粕苞菠蝴螞蠕褪詒踽鍊鎢閹饅髡魴冉冥妾尬尷惺捎攙櫥泗疵祈葦謚佣倔孚幌恕撬榕洼浬浥礫穢窿襠凜厥吩壕拷璇祠祚荸詛賂佼叨懾揣暇湃牟磋粟糜羈肱踶迤鵑嫉嬤悍撩晦烽矸碲箕肇臻訾踞颳俟匣嗦嘀嘈屎帷忱捶槭洩涌漪獗琉瑚瘠笈虞輾轆餚嗡垣婢嶇拙杲汕潼瀕瘟禧綾苑藹蛙譏軻輒迸酏靡鴿凋坳墟恝缽舖范茉遏闕鰭咪嗶娜嫻憋拯柑檀氖淩漕澎炬瘩砉耆腌蟻詆諺軹鍥閏馨冕劓复峪帚弼拭瀋禱筵羹薔裔軛奚弘楦檽甥瘡簸絆綻蜓諜躊迥銑伽婪恤棧汲炖甭窘芻蕃覲輜酋飭驥骼佇倪刁卣哮垃嫣懿沭瞥籬縐萋菡蚵鐳霎侉俾匾咀嘟噗圾嫡忡悸愷懊檄洄猿畿疤皚祆耘茗蜿誡謨轂頤佘俏夔妒妞巔懋攢梧樀汶矽窪篝繚荃蠹踉遁銬鎌鐮鬢鰻嗒嚕夸屹怠斡楨瀟瑤瞄舷芭蘑蛛酪鎬隴僥匕啪夯尸崆帛徊悒愕憨曳槓淇痹竇訥贄躇迦遽魛卅囤嬴焓煸燮瑩砰秸箐翟胭舀舐葆蛟跐踴雉黯哆弁弋彷悵檜涇渝漱灝瘓箔芙芥螢觥顱嗆嘖孽弈惋惦淞漩犀珮眩簍繽腋腑萃袒隅韭髖黝劊吠嘮惴攆斛暉毗渲溮炙燎瓘矗稷筠粽翬臆茁茴菴蒿貽蹠酉黍仕伶卯唬噫巒彊慟曨橄檯殉沅溥漾畦癟眈磊繹胱蟈跺鍬鐺馭黷么佯剃剄咆懦懨揌撿梓涂漉濘濛瀏痞盅簦纂虔諢驀倭冼几圩壬拽掐昶榷溺濂猥砷罃薊蟆蠡贅躑鉅佬兀嘹塾奐戟";
levelArray[8] = "掣擎棻樵漚灸煨盔矇碴繕臀芊芸荼藕褒覃覬跼蹂蹭逍鍺鍘鐐骸鰾亢吮廄廝徇憊搔擄擂涸狩瓢甦窨菖酣銫鐲髦仝嘍恬恿憧憖捺撂撻瀚灩瑋璞甬瘀睫瞟砑縊菁蓑藐詼鉦鐸鑊闌霹髫倌匡咎唁哧塈姥孥寔崛惘掇沱淙渙盎睬肄裴裱詣赭酈錚黥偕冗卦哽啄嗩坩塹寰扦挎捋杞桁沐澮燁瑜瘁硯笠笞簫紂翡脛苕萼豉雰鞅鬃鴇黜兮咄墅憫掄椎橘淄澦痙磧穄薌蛀蝗誨趴躡迢酗釩霆靛餑駙鵲亙儼匍媛幔徨慫憬拗暨曦桎榔榻沽瀘狸琵琶瘍皋篙粼絳纍翎舔莠蛾衢裊貰轍鎵鑷阡韁饃骯齎丐俸嚀扈拮掖搾晏暹棣獰痰砩秫笆籤羌蔫蘩蟒蟬訕贍郛醪饞鯕鵪剡叼咦唄唑坍塢姽彗怦懣抿攣杈棲淅瑙癖縈臃訛諦邃陂靳鶯伈僨卌啁姍婁崑嵊惚揖撟棨氪沘湫滎燜猞疣癮皦紜纓聆腆臍苧蜚賡醴鉚霓霏馥麂俐倩倖嚐囡寐巳憚揍櫓泠滀濰瀌燧甓瞌矚箅翌莧蕎袞褚貲踝踵鈺霰韜鰣鳩鷗麈鼾搳擻敕枸櫛涫湄溧潷瑒癩篾繄膘膺蠍貉轢鄱頎餒騁侃噎嬋屐悝掰攥晛桓槌檳沏漣燴璆瓮疚疸癭皎眸礪繆芫茹葷蒔蜘蜷蝟襌觴遐邛鄺釔銓靂顎駒鯪鷲仞儆冽剌嗟嗤嗔嘜惊愫攸敝斐旻桀楫櫚汐沄涎滕牘犢玁珩琛瓤祗稞糶紈繅翦翯胰蒺蚣蚕蝙褻蹩陲靦黛冑剞剟咂喔喙噩娼庾忸悚悻憮挹掬摳晁梔梟汴湉炫甌畋磐纔胛臊薺蛆蜈註諉豺蹜轤郴鐠閂餔齶剚咫嗷娑幠扉摒汩洵涓湋潓瀛焱瞑硌磴綌緋芍萵蕙蠔蠱豢貂";
levelArray[9] = "轅鈐閡驤佗傣勰吒吝呸啣啾噙嚶岱嵇忖昵沌淶漳燼爰璨痊皓瞰碫祉穀窅粳縹聿臼蚤蜥衽詁誥郫釙鉞閭黟鼴佚俳匐嗐孺愴拎抻斝杵櫟泱砒秕簃紝茭蒐藺謳讒蹙躪邸郾鄲醣鏗闞頜鱉鱒亶偎偁剷唷喟嚎媲宸撅榭歙沮沓浠渚潦澼熤燻猝玓珂璀瓏畈瘧瘢癸礡祜祟絀繇罔胯芷茜蓖軾邯釷銖鋯鍶鎧鑠闔鞁韞頷饌鯰鴛鼕伕倜僂匱喋喑噥囔圳圪奘妊媾嵎弩恙悴惆愬慥憔戡拊掾搐撙杳柞泓涮淖滓滁瓚痺盂眚矜碔穌簌緱羔膂膾膻藜蟿襤鋏鏢鑕鑫钁隍隈靄靼飩餛鬣亳伢侏凊刈吋坨塽婺岬嵬嶝忞悖扊揆揶揅撣曷榛樨洎涪溘犍猙瑕甑瘴癙皴瞳碣禨篦糌綦耷肛螃裨裾襏蹋蹌蹶輟逕郟酊鈁銥銣鑾鞿騫鯊鯔鸕鸞亓仡俅僦呷喱嗇嘧噤夙娠婧嫵幛恚揄枋栻殫氙汏洱潢潞煦煒璽癆睎砥祛窠簪緘緲縞翽荳薅薹蘄蜮詎謾賃賒蹉遒鈀鉍鏘鐃鑞闋阱隄鯗鱖鱧鳧鵠鶻俚俁俛偃倏僬冢厔嗖嘁噘圻婞嫦孑岷嵒嶙弭戢抉挈捫昊梵棬楹椴泯湮溏熵燿爔牒狒猗獷珀盩瞇祲禕稗穹笥纘羚腱莞葭薿蝠螟褸覷訄訑訢詰諛謅踹蹚蹺軼郇醺鈹鎘隕霈頊駢駸鬻鳲鴝鷂亟侗俑兗剜勦叱哿喏婕屙巽恪愜懺掱攄敖晢榤毽洮煜犄狉猷玷琥琰璘疽痱癲盪篆綷綹緙翱腴莆蓂螣謐謫贐趿郅郢鄜鄴醵錕鏤隤雋颯鴦鵷鶵鸚鼯俵傖儷冱呶咿啖啷嘌圄堊壹夤奭奼娩娌嫚峴彿忻怏怹捯搡梩椽歆毖氐泜浹濯玖璜睨睽碁秭稹筌箸";
levelArray[10] = "簟粲紆絜綬舂艄菽蓍蓼蘚螂蟋蠣衋諤趄逋酹醱鈽陟霾鞣鯡鱸鷺麒齷龕仃佝叵啜啻嗌嚏嚓嚆囝垽妍孛孿宓宕寮嶮忒怵惻惲慄揳擢旌旎暄梜槁橛櫧沚牚狎玦琬畚痘瞼砣硜竽筲箴篱籟紓縝羰耩芮荏茳葺蒞蕈蜎蜻蝤蝮蟀褓諳謔豇貳跚踮躕邇鄣鋦閾顴颼髀髻鬈鮫鯛鰷麝黿鼐鼷齲丌乂仄仨佶俎倣剮哅唰嚚塥姒姦嬪孀嶽徠戾掎摜攛椏樾檁歟氄涔浣溦潯濡瀍煇煲牠牯犖瑭痂痣盹硎磎磬穨笭笸筧筱緶耬胤舫蔾薰蛐蟠袼觺詡諍蹊蹣躋逖錒鑱霨颶颸馗鮆鯀鰹鱔鷦齮佤佻倢偈僭剕呎咻咭嗥嗊嗄嚲垌壅壚妯宬崍崦庠廛廩忣惇愊戛搽擘擯曖杓柩柚柘楮楂槤橐淼溽漯漭潏濜烝爿玀皈眄磯礄稔糴緡縉縚耔胔苫菂薈藎蛄蛔螻蟄袤訃豕貤賁輓轇遛遴鄖鈸鉉銃鑭閶闇頡頦駟驪骫髧髭鮭鮞鰩鱷鳶麾丕偌啕啐喁嘵囿圉埭墁婀嶂帑帩幡忑怛慍愾懵搆撳斠柃栲栒梮楸涿湟滂潸灄炆焗珙瑀瓿痔痍睏睢睿瞠碚磔礱竦笊箜篋篘粔紺緇綝縵罈罦羑翮脩舲艚芣芼苡莓堇葑蓽藪蘢藿蜉蟓蟾蟶蠲裲訌訏蹴躉軫逵鄠鈮鏜鏖鐫閆雝霽靚顒鯤鰨鰼鱘鼙齜仳伾俶傒僮儂儴刖剴剽匋卞嗑噀囫垸堠姘姣婭孬孱崴嵋嶸弒忪忐慼抈挶掽掮撏斕旐昳朮柢枵梲楝榫橇檣欷殄殮汊泅洹浡浯淯浞溟潲濮煬犒獍獾玳珌璐町畬疢痧癇皙皭睒睚瞽秈秣穊窈窕籐糲紵綑繾耒脰腒膈臚臾艤荑荇菹萏葚蓓蔻薏蚱蜃蝌蝜螫蟥裼";
levelArray[11] = "覿誆誑諂讕讞豳豸趵跎跛踫踟軔軑輦轗逅郯鄘銪閬靰顓餳駘騤驍髏髑鮐鱺黠鼫龠仉佉佟侂倀僉僖儈儋刎勍厝叻啵嗉噲嚅嚳囁囹垞堞塋墬媵嫠孳宥尕峋崢嶓幃忤恂慇懍戇戕抃挂捽摠斿旮暌暠杼杻柺桼椑槃榰榍榿榥橦檉櫂欞氂氅氆汙泃洺涊淝淴湎渢濉瀨烜牖牴狙狷獺玠珣琯琨琖璣璪疋疌疝痳瘌瘸癰瞵矬稃稙笢箬簋篳糨紇絖綰綪緗纈罄翕耖肓腓臏苒莒莨莪菰蕻虢蚍蛉蛺袂袗袈裟覂覦訐謖讖趲跖踅蹁蹓蹢蹼遑邈邕釃釅銍銦錞鎰鎦鏌鐓鐙陔雒靽韍顳餈餕餬騏骷鬲魆鯧鰍鰶佞傴儵勣厂唏喤嗲囀囈囉埴埡埼堝堙塒墈壙姞嬈宧岫帙幄庖彘徉怊悌悽愆慵戽扑摁摺摽擷擼攖敓桴梏梖棪椐椹欒歎殞沆沔泔洳洚洇溈澉澴瀦瀲灊炱焜燏犰獬珞璟璦璵瓖甪畎瘊盍矓硤礧窳笱篁糅糗縑縻羯羸腧臑舋舢舡舸艴苣茱茞莙菟葩蓴蕺蘘蘼蝻褊褫褡襆覡訖詮詬謄譆豚賚赧趔跕蹍蹇躚躥迺邂郃郕郜酃醢釤鈑鈧錸錁鍇鐒闈闒阽陘隗靺鞦韙餿騖驊髳魨鵜鶚鶩麇齟伉佰倥偊儽兕哂啈嗝噱噭圮埒夼妗婊嫿嬖屌崙崞崮嶢嶧幗廎忝惓愎憒掫搠摭摶摞擤斮旒昕昉昱昫晻暘曏杙枻柷梃梐桷棽棼楯榧櫪櫨殍汜汧泖洧洫洙洑淥湔澍澌澽灞炷煢燹犋狴猁珅琺琭璅璠璡璫畀甾疹痦瘐瘰癃癘睞砭砮碓碇磑祓穠穭窸笤笪籧糈絅綃縋繢纆罟羋羝耨耰聃聒艅茈莘荽萇菉葸萩蓁蓺蕨薙薴蘡虻蚶蚰蜆蜢蟑";
levelArray[12] = "螳蟛衾裯誚諑譎譔讆讋賅蹐躐輞轡迨逡遨邶邰郈郤郪郿鄔鄞鄢釵鈇鉈鋃鋌鎡鏞鐔靨韔顙饜驃魌鮓鰉鱭鴆鶉鵡鷓鷙麋黻鼒齏仟佾侑佽佹佫倨倬傕傯僳儕儓儻刓刳勖勩勱勼叟咑呣咩咼哞唚啶喵嗈嘏噌嚄囅囟坌坫垓堀堶妁妲嫪嬗岵崚嵯嶗廡彀徜怩恁悛悾悱愔慳慪拶掊捭搒搌搴攲旃旰晷曀曌朊朐杕棖楬槎樗橈檇櫼櫸歿毌毐氍洌涘淦淠滏滹潟澒潕澥濼瀣烊熥熳燔爨牝牾猓獐獠獪玎珽琮璁璈璩瓅畛畹疰瘺癤皰盦矍矰硠磣祔禡竑篥簉籜粞紟紲紱紬紩綞繙罌羼翳耵聵胂胼膦舛艋艿茖荻菼菑蓊蔞蕹虯蚪蚩蚋蜍蜴蠐蠵褭襞襫觫詈詿諠譙譖譫譾讎貊貔賕贇跣蹀蹕躒輈轔逯遢遹邋邠邴邽醯醽釧釹釽鉭鉏銠鉿錡錙錛鎏鎛鏃鏦鑣閎閿闐闤鞝鞫韉颺饗鬎鬩鬮鬯魎魘鱈鴞鴟鵁鵒鶂鶿黦齦乇乜乩仵倞倷僰儌儺剋劬厴叡呤哏呲唈唳喎嘽嘬噦嚜垟垚埆埻埏墉墘墀墦奩妣妺姱娉媯嫖嫘嬃宄寀尻屣崤嵫崳嵽嶠嶷巋庥弶徯忭怙怍悃惎慊憝懌懟捃挲揃搰撉攮斫旄旟晞暵曄曚朏杌柝桄楛榾樛櫜櫬歃殤殣殪殽氕氤氾汫泫洨洭洿泚涑湴湞湨溲溱滃滻滫澠澫濠濞瀅瀧瀼瀵焌熜燊燠爇爻牁牂狃狨狺獮獼玕珈珪琇琀瑗瓠瓻瘈瘭皞眇眥睇矞矧砦碭礞祧禊禛穰笄筦筴篌籙籹粧糒絎縠縲縩繒繻纑纚缶罳罽胠胗腯舨茆苾苴茌菅菔菏菥菘葎蓐蓰蕆蕤蕁藂蛩蝣蝥螗蟊螽衩袺裎褌褳襁襝觚觭觳觿訇";
levelArray[13] = "訒詘詵諔諶谿賻贔趺跗跬踣蹔躓輅輶迓邐邘邡郋鄹酢醅醑醮醭釕鈚鈿鈰鉺鋈錆錣鍆錤鍤鎲鏑鏇鐨閫闍閽闉阢阬隰霪靉靸鞬顢飧餼饉饈饕駑騄騅騸驁骰鬘鯁鯖鯷鰥鰳鴃鵏鶺鷖鷥鷯黼齔齕齪亍亹仂倓儔儱冇刲劌劙劭匏匜卮卼吰呔唼唪喈嗍嗙嗾嚃圂圇圌圞坁坼垵埕堍堽壈夬奰妘姁姮娀娭婘媟媼嫗嫫嬔嬙孖宭寤尥岈岣岢峇崁崒崟嵲嶍嶒嶨嶴巉巘巿帡幧幪庳廨弇弮弸彧彳徛忮怫恓惝惛愐愍愨慓慝憯懃戌扃扤抔捌挩捩掞揎撝揠揲搋摋擿敉斲旂旯昀昝晡晬暍暐曈暾朘朳枓杪柒柁枲栟栳栝桹棶椋椸棰槨槿樘櫫欑欬欸欿歈殛殠毹氌氳氿沬淏湣湲滈溠溷溳漊濆潿澹澶澨濔瀔瀰灺炤炟焐焮熗熯燂爊爝牮犨犴狁狖狾狳猊猰猢猱猺獫獯玥玤珥琫瑁琿瑊瑢瑱瓔瓛瓴甍疐疔疥疳痎痿瘏瘃瘥瘼瘵瘲癜皕皤盉眊眙睆睅睊瞍瞋瞭矱矼硨磽磲礅礵禋禤禰禳穇窊窣窬笏筅筮筥箠篨篔簏簣簠簹糝絁綈綆綯緹緦縟縕縯縶繰繯纛罅罍罡罛罹罻罾羆翃翛翥耋耜聹肫肭胍胴脢腩腡膙臢臬舯舳艎艟艫艮艽芎芑芟芰芾芨芩茀苻苤莩菸萸萑菾葖葶蒎蒟蒯蔦蓛蕖蕢薜薀薤薆薁薷藚藶虓虺蚺蛘蛑蜊蛸蜩蜞蜾蝂螈螬螵螮蟯蟢蠃蠆蠑蠖衄衎衿袢裒褟襜襦襭襮襴襻覘覯觶詖誄諏諞謦譸讙豝貐貘貺賨賧贉赬跆跏踖踧蹡蹯躂躞軺輬輳轀邙邗邾郗鄗鄶酇酡酤醁醐醍醰銛銎鋨鋆錟鋋鎯鍰鍠鏨鏐鏷閌閼";
levelArray[14] = "闃闠阼陴隉隳隼霢靆靿鞡鞨韆頇頫顑顥顰颭飥餖餭餱餮饐駰騂騧騭驂髁髣髲髹髽鬁鬌鬒鬟鮪鮸鯢鰈鰒鰤鱟鱠鴒鵂鵃鵓鶄鶒鶘鶗鶼鷁鶱鷸鸂鷿鸏鸛鸝麴黧黹黽鼉鼢齙齬";

var simplifiedArray = new Array();
simplifiedArray[0] = "的一是在不了有和人这中大为上个国我以要地他时来用们生到作出就分于对成会可主发年动同工也能下过子说产种行而方面后多定学法所民得经十三之进等部度家电力如水化高都自二理起小长物现实加量两体机还当使点从业本重去把性好应开它合因制由其些然前外天政四日那社义事平形相全里间样表与关各新线内数正心反你明看原又么利比或但质气第向道命此没变条只结解问意建月公无军很情者最立代想已通提直题党程展五果料象员革位入常文总次品式活设及管特件求老头基资边流路级少图山统接知较将组见计别她手角期根论运农指几九区强放决西被做必战先则任取据回给调处队南色光门即保治北造百规热领七海口东导器压世金增争济阶油思术极交受干联认六共权收证改清志己美再转更单风切打白教速花带安场身车例真务具万每目至达走积示议声报斗完类八离华名确科传张才信马节话米採整空元况今集温土许步群石广且记需段研界拉林律叫究观越织装影算低持音众系书容儿际商非验连断率深难近须矿千省委素技备半办青列习便响约支般史感劳团往酸称市克何除消构府甚太精歷值系周什号族维划选标写存候亲毛快查效斯院江型眼王按格养易置派层片始却专状育厂京识适参属圆包火住满县局照准红轻引细听该铁价严底首液";
simplifiedArray[1] = "官德随病失尔死讲呢苏配女黄推显谈罪神艺席含企望密批营项防举球英氧势告李落布木帮轮破亚朝师围远字材注排供河态封另復施减树溶怎止案台言士均武固叶鱼波视仅差费降紧爱左章早害续服食试充兵源判似司护足某练略田黑犯负击继兴坚输曲修故城觉夫够送笑船右财吃富春职汉画功巴里跟虽杂板飞佔曾乐致检吸里助阳互初创抗考投坏策古径换未跑留钢端责站简升述钱副尽帝射草范承独令限阿宣环双请超微让控州良轴找否纪益依优顶础载倒房突坐粉敌客袁冷胜绝析块剂测丝协诉陈仍罗余盐友洋错苦夜刑移模频念逐靠混母短皮终聚汽村哪既卫距校停烈央察烧迅境若印洲刻括激孔搞室待核散侵吧甲久菜味旧湖货弹损预阻毫乙普稳妈植息扩银语挥酒云守拿序纸医熟缺雨吗针刘啊急唱训误愿审血附茶鲜粮斤孩脱硫善肥演龙父渐欢掌械歌沙获着刚制攻谓盾讨晚佈粒乱燃矛乎杀复药宁鲁贵煤伯读班句香迫介丰培握兰弦担蛋沉假执穿答谁顺烟缩脸喜脚异免困背星福买染井概慢怕游磁倍祖皇薄促静补评钟翻肉践尼衣宽扬棉希伤操藏垂宜秋氢露套督笔振亮宪末架庆绿编牛映触销雷座诗居抓裂胞唿娘景盟威晶厚衡孙延鸡危胶屋乡沖临陆顾掉呀奇灯岁措束耐剧玉赵跳哥季课凯额齐款绍伟蒸永殖宗苗川炉弱杨零奏沿岩探滑镇饭浓航怀赶库夺伊";
simplifiedArray[2] = "税灵途灭赛召归鼓播盘裁险康唯录菌纯盖横繫私符努堂域糖枪润幅哈竟泽脑壤碳欧侧遍寨干敢彻恶虑斜庭纳于塞折饲伸湿麦荷暗瓦床卡筑户塔访透刀旋借氯遇份毒泥退洗虫摆灰彩卖圈耗夏择忙献铜硬予削卷繁雪亦函抽篇阵阴丁尺追堆盛雄迎泛楼爸避谋吨野猪旗偏典馆索秦脂潮爷忽塑遗松累愈朱替纤豆倾粗尚痛楚惊壁冲谢奋购磨君池旁碎骨徵监捕弟胡暴割殊贯释托词顿宝午尘闻揭炮残桥妇综警招吴付浮遭徐冬您摇谷箱隔订男吹园柱唐纷败嘴宋玻巨耕坦荣湾闭键剥凡并驻救锅恩凝碱齿截迹麻禁纺废版缓净睛昌婚涉筒插岸朗庄街姑贸奴炼腐啦惯乘恢匀梁纱辩耳彪抵臣亿脉璃秀萨俄网舞店喷纵寸童汗洪贺闪挂柬爆烯勒津轧稻软勇像杆厘滚蒙芳肯坡腿仪旅尾伙荡冰贡登黎钻秘逃障氨汤郭亡峰币港伏梦亩轨毕擦莫刺浪援株健售股采岛泡甘睡铸休阀牧绕哲炸磷朋绩淡启尖陷柴呈徒颜泪稍忘扎泵蓝拖洞弄授镜埔壮辛锋虚贫佛弯摩泰匯幼尊廷窗纲氏隶疑宫姐震瑞怪尤夹循琴描膜违珠缘腰枝森穷竹沟催忆绳邦剩栏浆拥牙贮礼滤钠纹咱拍罢幸喊袖埃勤焦罚伍潜墨缝姓刊畜饱奖铝余鬼丽挖跨默链仿扫喝袋壳炭幕诸弧污励梅奶洁灾舟鉴苯讼抱毁懂寒智寄届跃挑渡丹艰贝拔爹戴码芽碰赤渔哭铅敬颗奔欲仲柯稀虎妹乏珍桌申遵允螺隆仓魏晓锐征兼氮隐";
simplifiedArray[3] = "墙碍赫忠拨准肃缸抢牵博巧兄杜讯诚碧祥页巡矩寻悲灌龄伦票桂圣恰恐郑趣抬荒贴腾柔滴呵勐辆阔劲妻填撤储舍浅闹扰紫赞砂戏递吊陶伐疗瓶婆臂抚摸忍虾胸邻偶挤弃巩铺乳槽松仁吉邓熔烂砖租签乌舰伴瓜丙暂燥谱橡暖柳牌秧縴迷胆详簧踏呆瓷宾洛煳愤竞隙怒粘乃绪肩籍辉敏熙皆桿侦悬掘享纠醒狂锁恨牲霸志爬赏玩逆陵祝浙秒貌役彼悉冒鸭蜡趋涂凤晨辈秩卵署梯炎滩筛驱峡啥寿译浸泉帽硅迟疆棋贷漏冠嫩稿胁芯牢叛蚀奥鸣岭羊凭串塘绘融酵盆锡庙冻摄筹辅袭拒筋僚旱钾漆鸟眉添疏棒穗埋硝韩侨扭逼挺凉栽碗炒杯劝患贊馏豪辽勃鸿吏旦拜狗辊掩饮搬骂勾辞扣丈估绒蒋雾面姆拟朵宇辑陕番雕偿蓄剪崇倡咬厅薯驶刷斥赋奉扇曼沈漫浇钙桃仔扶俗返亏腔鞋叔悄撞框覆週骗勘旺沸孤黏吐孟屈渠仰妙惜疾辟狠胀谐抛喂霉桑哩衰嘛岗棱渗盗脏赖甜曹阅厉肌烃巷毅纬昨伪煮症搭钉茎笼嘆纶酷鬍偷弓锥恒游坑鼻叙狱翼络逮涌罐抑棚膨寺砌蔬骤穆冶枯凸绅坯焰牺册轰緻晋瘦丧垄锭锦旬锻邀欣亭酯舒迈忧脆闲扑涨羽酚顽卸拌仗陪姚惩杭捉肚飘漂搜吾昆欺郎汁烷萧邮雅饰尸燕迁姻撒赴宴债帐烦斑旨铃醇董姿雏饼傅妥腹拆捅揉淀贤歪葡丢徽浩胺垫昂挡览贪慰抹缴冯樑汪慌诺姜谊闆劣耀诬搅昏盈躺乔溪骑丛卢誉咨闷屏驾俩悟缆摘掷饵堡颇幻惠柄佳惨";
simplifiedArray[4] = "仇御窝腊宿剑涤瞧泼罩葱捞泊霍胎苍湘滨砍霞邵酬萄淮熊疯遂烘粪戈档嫂裕驳徙吓捐箭撑肠摊殿莲辨酱疫哀堵蔡沫皱畅叠莱阁敲辖痕钩坝熘丘玄祸饿曰彭逻卿吞妨艇韦怨柏歇矮捻禄郊漠冤宏粹颠仙肪刮押挨娃醛拾勿侯吪夕恋锌篡兆淋蓬岂釉妄拘捲魂摧氟颂浑诱蹟铀犁谴嘉墻戚扯滋犹舶萌颁焊舌匹尝媳肺掠烹疲酿窄驰鸦狭辱契敦遣菲韧拳辣秆卧醉墓矣竭茅艷舆缔账尿葬履渣禽衬赔躲奸溉稼贼妃抖醋廉掀晴裤后茫亥悠拦慧阐佐孝竖佩绣遥麟挽捨逝愁昭肖窑臭芬逢捷堤宙盲闸披辐凿凶幽拓杠狼崩慎绸蜂惟誓錶餐叉址帜弥芝僕唉涛慨翠饥劫卜盒倘寂椒炳畏閤颈凌喉垦巾拼兽干爽蔽芦挣窃谭谬褐伞儒翅颤剖晃胚凑浊眠杰霜礁蔑喀抄奈闯碑耶蓉刨唤壶栅猜蹲掏梳朴澳玲纽绵郡锯膀锤鼠椅殷穴遮吵萍厌俱吕囊捧澄哎瞬闽雌饶哨浒俺茂蘗勋肝盯籽耻滥菊帅戒鞭询镁宅淀烤贾跌笛蛮鄂棍睁鹝云岌历鼎侍嚷藩匪颖糟缠卑堪坛氛悦碘缚屠攀溢甫凹拱携晰朽吟迪菱谦俊婶盼艘芒唇挫浴羞趁岳愚疼肿萎枢绞餵嫁慕兹舱苹豫谕蚕潘翁迭顷匠榜欠沾畴胃茬踪哼弊桐歧沃溃鹏悼惑蔗晒潭孢诊庸涡迴嫌聪哦厨梭祁肆赠钳庞崖丑篮并甸胖藻夸捣撕诏贞慈炕赐卓汛琼铲挠棵灶馈婴祭肤蒂衫仑杰勉沥沪逸嗓晕浦蜜膏艾赢兔孕怜扮蒲鹅呖挪淑谣廊惧缅俘咽骄宰陡僱";
simplifiedArray[5] = "峻恼腺诞夷愉猎魔哟扛葛荫铵嵴倚扁杏椭溴滞苛钞锰镶捏斩氓傲僵匆屑烫衍郁卤拢裸邪坊渴舅泄翔厦柜钦窖猫媒脾噪昼蛇耙耿昙秤粱糕衷贩辰哇嘱宦扔杉诈吁冈廓悔皂氰肴剎勺寓玛矢垮淘瓣笋罕钟喇帕恭摔桉秉铭鬚斋俭叭帆瘤砸祼篷肢藤拐脖暑瞪歼竿笙蕴酮哗瞎刃嵌楔扎藉喘厢挝枚粤咸拴爪甩膝恳腕娓屡熄锚噹忌愧丸圃榨荆骚屯毯蒜蠋俯弗梢衙鹿扒洒轿哑垒谅贱踢棕泳泌渥滔衔饷吻搁梨樱熬奠姨乒惕聘郓冀绑咖尉裹酥寡彦啡稠拼擅汝汰蚌钝銹捆敞逊雀栋谨鲤咳搏葫贿鳞占塌忉谎咋怖戊桔腻龟嘻坟禾坎拇掺煽狮寇梗鹰哄胳莽雯傻喻坪渊糠涅跪钊侮奕枕膛蕊譬兑寥扼辫腥郝戍晒耦蹄钧匈屁戥桩瞿诵倦屿抒涵袍钓嗣忿敷湜聊虹蹈咸嗯姬凄灿狡糙蹬僧嗨栖笨辜枉翰茨讽哌岐崭枣咕揽汹涝焚猴耍趟傍噼爵璋虏镀昔瞅踩迄钥汞祺诡魄嘲惶赃咐歉癌庐扳聂芡躯鄙拧煌襄贬隋佑宠懒栓滇炊謇憾裙赣骆兜孵曝泣猖痼盥絮韵噢旷洴盏眷茄暮榴淆溅煎琪鰲乞吼唧哒巢槐沛蜇蜀赚陛幂咒尧捍昇铰叮焕煞耽褂募拣搓淹釜铬雹灼瑰邹鲢娇彰焉荐躬匙咯庶惹沦琳畔蛤鹤毙渍皖禹邢卒庵淫窜绷翘箪陌兇巫柜玫膊鞑拂澜绥蕉赎雇囱寅稚缕赌躁锄颊庚氦珊苟荐蛭蜕酌魁撇朕焘蔓豌逗闺佃侄桅荧缉襟镍乍嗳娶洒耸饪唸嚣瀑痴筐裳靖靶韶崔茧蓿镕剿喃娥岔搪撮氘";
simplifiedArray[6] = "雍霖撰粥虫吱慷檐琦莉袜豹赦邑闢骏凳喧媚挟晤睹吁舵隘雁鳃俞嚼愣揪桦澧蠢唆噶弛懈涧绢薪寞憎戎毡沼眨磺钮锣佣奢矫肾薛丞巍橙涩疙碌脯蝇髓鲍厄嘎宛淤畸砝磅簇羟荔蕾虐逾姊斧烙狄蚜喳垠帘斌棺琐瞒筏骡鸵囚惰昧殳烁祇窒僻啼坤婷怯晌楣镑黔丫崧怔晾棘泮溯泻睦窥蜡陋吶嘘墩悢莸衅麓唔嗜坠孰屉慾旭梆瑟眯臧菇馌剔寝峨炔炽琤瑾帘肋肘臺蛹鞍硷嗅婿孜楞涯痒祯禅羡虱酝伎宵峭朴枫熹蚊蝶驴丑噬伙庇杖牡稽蔚逞鞠饺驯吭栩犬皿硼竺羧讶咏诃鞘垢妖攫歹碉磕豁铧阮飗傀凰咧啤廙楷渤熏聋闵彝敛朔淌瞻御缀缎轩併儡堕憓抨挚汀渎禀筷蒴蟹诧赳陀峒纫芜谒券哉呜扞漓碾秃茸蔔跋迂锉驼侠嘿崎恫摹檬柠诛躅醚馅魅魑伺唾幢戋桨瑯穫笺苓茯谜钛锂柿楠毓涕渭炯茵袄逛霄劾娱洽湝眶箍胥钴铂嚙妆惭拈棠氩硒荪蘸袱钡乖啸奎娟巯帖彤戳滍禺箩紊羿芋裘讳谤尹渺澈筝笃簿鲫鲸吆哺啃埠栗汾猾硕託鲋岑峙庤廖徘榆氡湍潺琢砧莎踱锢阎阜隧鱿嘶妮捂殴汆筘苔删喓圭捄殆熨眺睪侈侣垛恍湛甄稜羲翊芹钼匿恃戬殃毋滦狐竣舜荀诀谆饯郁剁叩婉憩朦樟氚淬窟詹亨咚嗽圜壑崽沧澡痢瘫碟葵觅逶靴颓饴骇叽咙廿胧沁焯翩腮脓薇蜗袆觜诽邱驮驿埂奄汇怡椰浚焙猩痒矾绚耑膳褥褶谏锷锈颱匝呃岚厕彬恣戮撼椿樊沂淳狈窍绰褙蹦髯卉帧瑛绮菩萱闿呻堰妓";
simplifiedArray[7] = "娣嬉徭掂揩擒攘槛荚蚓蚯趾酐锑颋飢龚兢呕夭搂斟曙札枷殡祀穜粕苞菠蝴蚂蠕褪诒踽鍊钨阉馒髡鲂冉冥妾尬尴惺捎搀橱泗疵祈苇謚佣倔孚幌恕撬榕洼浬浥砾秽窿裆凛厥吩壕拷璇祠祚荸诅赂佼叨慑揣暇湃牟磋粟糜羁肱踶迤鹃嫉嬷悍撩晦烽矸碲箕肇臻訾踞颳俟匣嗦嘀嘈屎帷忱捶槭洩涌漪獗琉瑚瘠笈虞辗辘餚嗡垣婢岖拙杲汕潼濒瘟禧绫苑蔼蛙讥轲辄迸酏靡鸽凋坳墟恝钵舖范茉遏阙鳍咪哔娜娴憋拯柑檀氖凌漕澎炬瘩砉耆腌蚁诋谚轵锲闰馨冕劓复峪帚弼拭渖祷筵羹蔷裔轭奚弘楦檽甥疮簸绊绽蜓谍踌迥铣伽婪恤栈汲炖甭窘刍蕃觐辎酋饬骥骼伫倪刁卣哮垃嫣懿沭瞥篱绉萋菡蚵镭霎侉俾匾咀嘟噗圾嫡忡悸恺懊檄洄猿畿疤皑祆耘茗蜿诫谟毂颐畲俏夔妒妞巅懋攒梧樀汶硅洼篝缭荃蠹踉遁铐鎌镰鬓鳗嗒噜夸屹怠斡桢潇瑶瞄舷芭蘑蛛酪镐陇侥匕啪夯尸崆帛徊悒愕憨曳槓淇痹窦讷贽躇迦遽鱽卅囤嬴焓煸燮莹砰秸箐翟胭舀舐葆蛟跐踊雉黯哆弁弋彷怅桧泾渝漱灏痪箔芙芥萤觥颅呛啧孽弈惋惦淞漩犀珮眩篓缤腋腑萃袒隅韭髋黝刽吠唠惴撵斛晖毗渲浉炙燎瓘矗稷筠粽翚臆茁茴菴蒿贻跖酉黍仕伶卯唬噫峦彊恸昽橄檯殉沅溥漾畦瘪眈磊绎胱蝈跺锹铛驭黩么佯剃刭咆懦恹揌捡梓涂漉泞濛浏痞盅簦纂虔诨蓦倭冼几圩壬拽掐昶榷溺濂猥砷罃蓟蟆蠡赘踯鉅佬兀嘹塾奂戟";
simplifiedArray[8] = "掣擎棻樵沤灸煨盔矇碴缮臀芊芸荼藕褒覃觊跼蹂蹭逍锗铡镣骸鳔亢吮厩厮徇惫搔掳擂涸狩瓢甦窨菖酣铯镯髦仝喽恬恿憧慭捺撂挞瀚滟玮璞甬瘀睫瞟砑缢菁蓑藐诙钲铎镬阑霹髫倌匡咎唁哧塈姥孥寔崛惘掇沱淙涣盎睬肄裴裱诣赭郦铮黥偕冗卦哽啄唢坩堑寰扦挎捋杞桁沐浍烨瑜瘁砚笠笞箫纣翡胫苕萼豉雰鞅鬃鸨黜兮咄墅悯抡椎橘淄滪痉碛穄芗蛀蝗诲趴蹑迢酗钒霆靛饽驸鹊亘俨匍媛幔徨怂憬拗暨曦桎榔榻沽泸狸琵琶疡皋篙粼绛纍翎舔莠蛾衢裊贳辙鎵镊阡缰馍骯赍丐俸咛扈拮掖搾晏暹棣狞痰砩秫笆籤羌蔫蘩蟒蝉讪赡郛醪馋鲯鹌剡叼咦呗唑坍坞姽彗怦懑抿挛杈栖淅瑙癖萦臃讹谛邃陂靳莺伈偾卌啁姗娄崑嵊惚揖挢棨氪沘湫荥焖猞疣瘾皦纭缨聆腆脐苎蜚赓醴铆霓霏馥麂俐倩倖尝囡寐巳惮揍橹泠滀潍瀌燧甓瞌瞩箅翌苋荞衮褚赀踝踵钰霰韬鲥鸠鸥麈鼾搳擞敕枸栉涫湄溧滗玚癞篾繄膘膺蝎貉轹鄱颀馁骋侃噎婵屐悝掰攥晛桓槌槟沏涟烩璆瓮疚疸瘿皎眸砺缪芫茹荤莳蜘蜷猬襌觞遐邛邝钇铨雳颚驹鲮鹫仞儆冽剌嗟嗤嗔唛惊愫攸敝斐旻桀楫榈汐沄涎滕牍犊玁珩琛瓤祗稞粜纨缫翦翯胰蒺蚣蚕蝙亵蹩陲腼黛冑剞剟咂喔喙噩娼庾忸悚悻怃挹掬抠晁栀枭汴湉炫瓯畋磐纔胛臊荠蛆蜈註诿豺蹜轳郴镨闩餔腭剚咫嗷娑幠扉摒汩洵涓湋潓瀛焱瞑硌磴绤绯芍莴蕙蚝蛊豢貂";
simplifiedArray[9] = "辕钤阂骧佗傣勰咤吝呸啣啾噙嘤岱嵇忖昵沌涞漳烬爰璨痊皓瞰碫祉谷窅粳缥聿臼蚤蜥衽诂诰郫钋钺闾黟鼹佚俳匐嗐孺怆拎抻斝杵栎泱砒秕簃纴茭蒐蔺讴谗蹙躏邸郾郸醣铿阚颌鳖鳟亶偎偁剷唷喟嚎媲宸撅榭歙沮沓浠渚潦澼熤燻猝玓珂璀珑畈疟瘢癸礡祜祟绌繇罔胯芷茜蓖轼邯钍铢锆锶铠铄阖鞁韫颔馔鲇鸳鼕伕倜偻匮喋喑哝囔圳圪奘妊媾嵎弩恙悴惆愬慥憔戡拊掾搐撙杳柞泓涮淖滓滁瓒痺盂眚矜碔稣簌缑羔膂脍膻藜蟿褴铗镖鑕鑫镢隍隈霭靼饨馄鬣亳伢侏凊刈吋坨塽婺岬嵬嶝忞悖扊揆揶揅掸曷榛樨洎涪溘犍狰瑕甑瘴癙皴瞳碣禨篦糌綦耷肛螃裨裾袯蹋跄蹶辍迳郏酊钫铱铷銮鞿骞鲨鲻鸬鸾亓仡俅僦呷喱啬嘧噤夙娠婧妩幛恚揄枋栻殚氙汏洱潢潞煦炜玺痨睎砥祛窠簪缄缈缟翙荳薅薹蕲蜮讵谩赁赊蹉遒钯铋锵铙镴阕阱隄鲞鳜鳢凫鹄鹘俚俣俛偃倏僬冢厔嗖嘁噘圻婞嫦孑岷嵒嶙弭戢抉挈扪昊梵桊楹椴泯湮溏熵燿爔牒狒猗犷珀盩瞇祲祎稗穹笥缵羚腱莞葭薿蝠螟褛觑訄訑訢诘谀诌踹蹚跷轶郇醺铍镉陨霈顼骈骎鬻鸤鸲鹞亟侗俑兖剜勦叱哿喏婕疴巽恪惬忏掱摅敖晢榤毽洮煜犄狉猷玷琥琰璘疽痱癫盪篆綷绺缂翱腴莆蓂螣谧谪赆趿郅郢鄜邺醵锟镂隤隽飒鸯鹓鶵鹦鼯俵伧俪冱呶咿啖啷嘌圄垩壹夤奭奼娩娌嫚岘彿忻怏怹捯搡梩椽歆毖氐泜浃濯玖璜睨睽碁秭稹筌箸";
simplifiedArray[10] = "簟粲纡絜绶舂艄菽蓍蓼藓螂蟋蛎衋谔趄逋酹酦钸陟霾鞣鲱鲈鹭麒龌龛仃佝叵啜啻嗌嚏嚓嚆囝垽妍孛孪宓宕寮崄忒憷恻恽慄揳擢旌旎暄梜藁橛槠沚牚狎玦琬畚痘睑砣硁竽筲箴篱籁纾缜羰耩芮荏茳葺莅蕈蜎蜻蝤蝮蟀褓谙嚯豇贰跚踮蹰迩鄣锔阈颧飕髀髻鬈鲛鲷鲦麝鼋鼐鼷龋丌乂仄仨佶俎倣剐哅唰嚚塥姒姦嫔孀岳徕戾掎掼撺桠樾檩欤氄涔浣溦浔濡瀍煇煲牠牯荦瑭痂痣盹硎磎磬穨笭笸笕筱缏耧胤舫蔾薰蛐蟠袼觺诩诤蹊蹒跻逖锕鑱霨飓飔馗鮆鲧鲣鳝鹪齮佤佻倢偈僭剕呎咻咭嗥唝嗄亸垌壅垆妯宬崃崦庠廛廪忣惇愊戛搽擘摈暧杓柩柚柘楮楂槤橐淼溽漯漭潏浕烝丬猡皈眄矶硚稔籴缗缙縚耔胔苫菂荟荩蛄蛔蝼蛰袤讣豕貤贲輓轇遛遴郧钹铉铳镧阊闇颉颏驷骊骫髧髭鲑鲕鳐鳄鸢麾丕偌啕啐喁哓囿圉埭墁婀嶂帑帩幡忑怛愠忾懵搆揿斠柃栲栒梮楸涿湟滂潸滠炆焗珙瑀瓿痔痍睏睢睿瞠碚磔砻竦笊箜箧篘粔绀缁綝缦罈罦羑翮脩舲艚芣芼苡莓堇葑荜薮茏藿蜉蟓蟾蛏蠲裲讧訏蹴趸轸逵鄠鈮镗鏖镌闫雝霁靓颙鲲鳎鳛鲟鼙龇仳伾俶傒僮侬儴刖剀剽匋卞嗑噀囫垸堠姘姣娅孬孱崴嵋嵘弒忪忐慼抈挶掽掮挦斓旐昳朮柢枵梲楝榫橇樯欷殄殓汊泅洹浡浯淯浞溟潲濮炀犒獍獾玳珌璐町畬疢痧痫皙皭睒睚瞽籼秣穊窈窕籐粝纻綑缱耒脰腒膈胪臾舣荑荇菹萏葚蓓蔻薏蚱蜃蝌蝜螫蟥裼";
simplifiedArray[11] = "觌诓诳谄谰谳豳豸趵跎跛踫踟轫轪辇轗逅郯鄘铕阆靰颛饧骀骙骁髅髑鲐鲡黠鼫龠仉佉佟侂伥佥僖侩儋刎勍厝叻啵嗉哙嚅喾嗫囹垞堞茔墬媵嫠孳宥尕峋峥嶓帏忤恂慇懔戆戕抃挂捽摠斿旮暌暠杼杻柺桼椑槃榰榍桤榥橦柽櫂棂氂氅氆污泃洺涊淝淴湎沨濉濑烜牖牴狙狷獭玠珣琯琨琖玑璪疋疌疝痳瘌瘸痈瞵矬稃稙笢箬簋筚糨纥絖绾綪缃缬罄翕耖肓腓膑苒莒莨莪菰蕻虢蚍蛉蛱袂袗袈裟覂觎讦谡谶趱跖踅蹁蹓蹢蹼遑邈邕酾酽铚铟錞镒镏镆镦镫陔雒靽韨颞餈馂餬骐骷鬲魆鲳鳅鰶佞伛儵勣厂唏喤嗲啭呓啰埴垭埼埚堙埘墈圹姞娆宧岫帙幄庖彘徉怊悌悽愆慵戽扑摁摺摽撷撸撄敓桴梏梖棪椐椹栾叹殒沆沔泔洳洚洇沩澉澴潴潋灊炱焜燏犰獬珞璟瑷玙瓖甪畎瘊盍眬硖礧窳笱篁糅糗缣縻羯羸腧臑舋舢舡舸艴苣茱茞莙菟葩莼蕺蘘蘼蝻褊褫褡幞觋讫诠诟誊譆豚赉赧趔跕蹍蹇跹蹿迺邂郃郕郜酃醢钐钣钪铼锞锴铹闱阘阽陉隗靺鞦韪馊骛骅髳鲀鹈鹗鹜麇龃伉佰倥偊儽兕哂啈嗝噱噭圮埒夼妗婊婳嬖屌崙崞崮峣峄帼庼忝惓愎愦掫搠摭抟摞擤斮旒昕昉昱昫晻旸曏杙枻柷梃梐桷棽棼楯榧枥栌殍汜汧泖洧洫洙洑渌湔澍澌澽灞炷茕燹犋狴猁珅珐琭璅璠琎珰畀甾疹痦瘐瘰癃疠睐砭砮碓碇硙祓秾稆窸笤笪籧糈絅绡缒缋纆罟芈羝耨耰聃聒艅茈莘荽苌菉葸萩蓁蓺蕨薙薴蘡虻蚶蚰蚬蜢蟑";
simplifiedArray[12] = "螳蟛衾裯诮诼谲譔讆詟赅蹐躐辋辔迨逡遨邶邰郈郄郪郿邬鄞鄢钗鈇铊锒铤镃镛镡靥韔颡餍骠魌鲊鳇鲚鸩鹑鹉鹧鸷麋黻鼒齑仟佾侑佽佹佫倨倬傕偬僳侪儓傥刓刳勖勚劢勼叟咑呣咩呙哞吣啶喵嗈嘏噌嚄冁囟坌坫垓堀堶妁妲嫪嬗岵崚嵯崂庑彀徜怩恁悛悾悱愔悭怄拶掊捭搒搌搴攲旃旰晷曀曌朊朐杕枨楬槎樗桡檇櫼榉殁毌毐氍洌涘淦淠滏滹潟澒潕澥泺瀣烊熥熳燔爨牝牾猓獐獠狯玎珽琮璁璈璩瓅畛畹疰瘘疖疱盦矍矰硠碜祔禡竑篥簉箨粞紟紲绂紬紩缍繙罂羼翳耵聩胂胼膦舛艋艿茖荻菼菑蓊蒌蕹虬蚪蚩蚋蜍蜴蛴蠵褭襞襫觫詈诖諠谯谮谵谫雠貊貔赇赟跣蹀跸跞辀辚逯遢遹邋邠邴邽醯醽钏钕釽钽鉏铑铪锜锱錛鎏镈镞鏦镳闳阌阗阛鞝鞫鞯飏飨鬎阋阄鬯魉魇鳕鸮鸱鵁鹆鶂鹚黦龈乇乜乩仵倞倷僰儌傩剋劬厣叡呤哏呲唈唳喎啴嘬哕嚜垟垚埆埻埏墉墘墀墦奁妣妺姱娉妫嫖嫘嬃宄寀尻屣崤嵫嵛嵽峤嶷岿庥弶徯忭怙怍悃惎慊憝怿怼捃挲揃搰撉攮斫旄旟晞暵晔曚朏杌柝桄楛榾樛櫜榇歃殇殣殪殽氕氤氾汫泫洨洭洿泚涑湴浈湨溲溱滃浐滫渑澫濠濞滢泷瀼瀵焌熜燊燠爇爻牁牂狃狨狺狝猕玕珈珪琇琀瑗瓠瓻瘈瘭皞眇眦睇矞矧砦砀礞祧禊禛穰笄筦筴篌箓籹粧糒绗縠缧縩缯繻纑纚缶罳罽胠胗腯舨茆苾苴茌菅菔菏菥菘葎蓐蓰蒇蕤荨藂蛩蝣蝥螗蟊螽衩袺裎裈裢襁裣觚觭觳觿訇";
simplifiedArray[13] = "讱诎诜諔谌谿赙赑趺跗跬踣蹔踬辂輶迓逦邘邡郋鄹酢醅醑醮醭钌鈚钿铈铒鋈锖錣钔錤锸鎲镝镟鐨阃阇阍闉阢阬隰霪叆靸鞬颟飧饩馑馐饕驽騄骓骟骜骰鬘鲠鲭鳀鳏鳓鴃鵏鹡鹥鸶鹩黼龀龁龊亍亹仂倓俦儱没刲刿劙劭匏匜卮卼吰呔唼唪喈嗍嗙嗾嚃圂囵圌圞坁坼埯埕堍堽壈夬奰妘姁姮娀娭婘媟媪妪嫫嬔嫱孖宭寤尥岈岣岢峇崁崒崟嵲嶍嶒峃岙巉巘巿帡幧幪庳廨弇弮弸彧彳徛忮怫恓惝惛愐愍悫慓慝憯懃戌扃扤抔捌挩捩掞揎撝揠揲搋摋擿敉斲旂旯昀昝晡晬暍暐曈暾朘朳枓杪柒柁枲栟栳栝桹梾椋椸棰椁槿樘橥欑欬欸欿歈殛殠毹氇氲氿沬淏愍湲滈溠溷涢溇濆涠澹澶澨沵瀔瀰灺炤炟焐焮炝熯燂爊爝牮犨犴狁狖狾狳猊猰猢猱猺猃獯玥玤珥琫瑁珲瑊瑢瑱璎瓛瓴甍疐疔疥疳痎痿瘏瘃瘥瘼瘵瘲癜皕皤盉眊眙睆睅睊瞍瞋瞭矱矼砗硗磲礅礵禋禤祢禳穇窊窣窬笏筅筮筥箠篨篔簏篑簠筜糁絁绨绠绹缇缌缛缊縯絷缲缳纛罅罍罡罛罹罻罾罴翃翛翥耋耜聍肫肭胍胴脢腩脶膙臜臬舯舳艎艟舻艮艽芎芑芟芰芾芨芩茀苻苤莩菸萸萑菾葖葶蒎蒟蒯茑蓛蕖蒉薜薀薤薆薁薷藚苈虓虺蚺蛘蛑蜊蛸蜩蜞蜾蝂螈螬螵螮蛲蟢蠃虿蝾蠖衄衎衿袢裒褟襜襦襭襮襕襻觇觏觯诐诔诹谝謦诪讙豝貐貘贶賨赕贉赪跆跏踖踧蹡蹯跶躞轺辌辏辒邙邗邾郗鄗郐酇酡酤醁醐醍醰铦銎锇鋆锬鋋鎯锾锽錾镠镤闶阏";
simplifiedArray[14] = "阒阓阼陴陧隳隼霢叇靿鞡鞨韆顸頫顑颢颦飐饦饾餭糇餮饐骃骍騧骘骖髁髣髲髹髽疬鬌鬒鬟鲔鮸鲵鲽鳆鰤鲎鲙鸰鸺鸼鹁鶄鶒鹕鶗鹣鹢鶱鹬鸂鷿鹲鹳鹂麴黧黹黾鼍鼢龅龉";

var closeBtn = document.getElementById("close-btn");
var tipsOpened = document.getElementsByClassName("tips-opened")[0];
var showTipsBtn = document.getElementsByClassName("tips")[0];
var letter = document.getElementById("letter");
var input = document.getElementById("input");
var anspic = document.getElementById("ans");
var title = document.getElementsByClassName("title")[0];
var inputArea = document.getElementsByClassName("input-area")[0];
var backBtn = document.getElementsByClassName("back")[0];
var difficultyCheckbox = document.getElementsByName("difficulty-checkbox");
var errorMsg = document.getElementsByClassName("errorMsg")[0];
var ansBtn = document.getElementsByClassName("showAns")[0];
var panel = document.getElementsByClassName("cangjieCodePanel")[0];
var panelCangjie = document.getElementById("panel-cangjie-code");
var panelEng = document.getElementById("panel-eng-code");
var simplified = document.getElementsByName("simplified")[0];
var solveOverflow = document.getElementsByClassName("solve-overflow")[0];


var theDifficulty = localStorage.getItem("difficulty");
var combinedWords = "";
var hasLocalStorage = hasLocalStorage();
var isMobile = isMobile();
var currentWord = "";
var lastWord = "";
var allowInputCheckFlag = true;
var simplifiedFlag = false;

function randNum(min, max){
    return parseInt(Math.random()*10000000)%(max-min+1) + min;
}

function changeWord(word){
    lastWord = currentWord;
    if(word == void 0)
        currentWord = combinedWords[randNum(0,combinedWords.length-1)];
    else 
        currentWord = word;
    letter.innerText = currentWord;
    panel.style.left = "-100px";
    panel.style.opacity = "0";
    anspic.style.display = "none";
}

function isMobile(){
    if(~navigator.userAgent.indexOf("Mobile")){
        return true;
    } else {
        return false;
    }
}

function hasLocalStorage(){
    if(localStorage.getItem("difficulty") == void 0){
        return false;
    } else {
        return true;
    }
}

function engToCangjie(Eng){
    var returnVal = "";
    var array = Eng.split("");

    for (i in array){

        var ascii = array[i].charCodeAt();

        if(~escape(array[i]).indexOf("%u")){
            returnVal += array[i];

        } else if(ascii >= 97 && ascii <= 122){ 
            returnVal += cangjie[array[i]];

        } else if(ascii >= 65 && ascii <= 90){
            returnVal += cangjie[array[i].toLowerCase()];
        }
    }
    return returnVal;
}

function cangjieToEng(Cangjie){
    var returnVal = "";
    var array = Cangjie.split("");
    for(i in array){
        returnVal += cangjie[array[i]];
    }
    return returnVal;
}

window.onload = function(){
    if(hasLocalStorage == false || localStorage.getItem("difficulty") == "000000000000000"){
        localStorage.setItem("difficulty", "100000000000000");
        localStorage.setItem("simplified", false);
        theDifficulty = localStorage.getItem("difficulty");
    }

    //var theDifficulty = localStorage.getItem("difficulty");
    var tempflag = localStorage.getItem("simplified");
    if(tempflag == "true"){
        simplifiedFlag = true;
    } else {
        simplifiedFlag = false;
    }

    if(simplifiedFlag)
        simplified.checked = true;

    for(var i=0; i<=14; i++){
        if(theDifficulty[i] == 1){

            safeCombine(i);
                
            difficultyCheckbox[i].checked = true;
        }
    }

    changeWord();
}

closeBtn.onclick = function(){
    solveOverflow.style.opacity = "0";
    solveOverflow.style.transform = "scale(40%)";
    solveOverflow.style.transition = "all 0.2s";
    setTimeout('tipsOpened.style.display = "none";solveOverflow.style.transition = "all 0.4s";', 200);
}

showTipsBtn.onclick = function(){
    tipsOpened.style.display = "flex";
    setTimeout('solveOverflow.style.opacity = "1";solveOverflow.style.transform = "none";', 100);
}

input.oninput = function(){
    /*if(input.value.length >= 2 && allowInputCheckFlag){
        input.value = input.value[input.value.length-1];
    }*/
    if(allowInputCheckFlag){
        input.value = engToCangjie(input.value);
    }
    if(input.value == currentWord ||  cangjie5[currentWord].indexOf(cangjieToEng(input.value)) != -1){
        changeWord();
        input.value = "";
    }/* else {
        title.style.backgroundColor = "#C2185B";
        inputArea.style.backgroundColor = "#E91E63";
    }*/
}

input.addEventListener("compositionstart", function(){
    allowInputCheckFlag = false;
    input.value = "";
});

input.addEventListener("compositionend", function(){
    allowInputCheckFlag = true;
});

document.onkeydown = function(e) {
    e = e || window.event;
    var key = e.key; // 使用 key 属性代替 keyCode
    if (key === 'Enter') { // 检查按下的是否是 Enter 键
        showAns();
    } else if (e.key === "Backspace" && e.shiftKey) {
        backToPrevWord();
    }
}

input.onfocus = function(){
    if(isMobile){
        document.getElementsByTagName("body")[0].style.overflow = "hidden";
    }
}

input.onblur = function(){
    if(isMobile){
        document.getElementsByTagName("body")[0].style.overflow = "visible";
    }
}

function backToPrevWord() {
    if(lastWord != "")
        changeWord(lastWord);
}

backBtn.onclick = function(){
    backToPrevWord();
}

for(let i=0; i<=14; i++){
    difficultyCheckbox[i].onchange = function(){
        theDifficulty = "";
        combinedWords = "";
        for(var k=0; k<=14; k++){
            if(difficultyCheckbox[k].checked){
                safeCombine(k);
                theDifficulty += 1;
            } else {
                theDifficulty += 0;
            }
        }
        if(theDifficulty == "000000000000000"){
            alert("請至少選擇一個頻序！")
            difficultyCheckbox[i].checked = true;
            safeCombine(i);
        } else {
            localStorage.setItem("difficulty", theDifficulty);
        }
    }
}

anspic.onerror = function(){ // Pending
    if(anspic.src != void 0){
        if(!simplifiedFlag){
            errorMsg.style.top = "-35px";
            errorMsg.style.opacity = "1";
            //errorMsg.innerHTML = "抱歉！沒有查到此字的圖形版倉頡字碼！<br> 其字碼爲：" + cangjieCode;
            setTimeout('errorMsg.style.top = "-60px";errorMsg.style.opacity = "0";', 2000);
        }
    }
}

ansBtn.onclick = function(){
    showAns();
}

function showAns(){
    if(panel.style.opacity == 0){

        

        panel.style.left = "0";
        panel.style.opacity = "1";

        if(!simplifiedFlag){
            // anspic.src = "http://input.foruto.com/cjdict/Images/CJZD_JPG/" + big5[currentWord] + ".JPG";
            anspic.src = `https://www.hkcards.com/img/cj/${encodeURIComponent(currentWord)}.png`
            anspic.style.display = "";
        }

        input.value = "";
        // if(isMobile && !simplifiedFlag){
        //     input.blur();
        // } else if(isMobile && simplified){
        //     input.focus();
        // }

        var pendingCangjieCode = "";
        var pendingEngCode = "";

        var arrayCangjie = cangjie5[currentWord];

        for(i in arrayCangjie){
            pendingEngCode += arrayCangjie[i];
            pendingCangjieCode += engToCangjie(arrayCangjie[i]);
            

            if(i != 0){
                pendingCangjieCode += "<br>";
                pendingEngCode += "<br>";
            }
        }

        panelCangjie.innerHTML = pendingCangjieCode;
        panelEng.innerHTML = pendingEngCode;

    } else {
        panel.style.left = "-100px";
        panel.style.opacity = "0";
        anspic.style.display = "none";
        if(isMobile && simplified){
            input.focus();
        }
    }
}

function safeCombine(line){
    if(simplifiedFlag)
        combinedWords += simplifiedArray[line];
    else
        combinedWords += levelArray[line];
}

function refreshCombinedWords(){
    for(var i=0; i<=14; i++){
        if(theDifficulty[i] == 1){
            safeCombine(i);
        }
    }
}


simplified.onchange = function(){
    if(simplified.checked){
        simplifiedFlag = true;
        localStorage.setItem("simplified", true)
        refreshCombinedWords();
    } else {
        simplifiedFlag = false;
        localStorage.setItem("simplified", false)
        refreshCombinedWords();
    }
}
